app/controllers/portfolios_controller.rb

  def index
    @portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["subtitle", "test"], ["body", "stuff"], ["created_at", "2017-06-29 00:40:46.431235"], ["updated_at", "2017-06-29 00:40:46.431235"]]

  def update
    @portfolio_item = Portfolio.find(params[:id])

    respond_to do |format|
      if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "portfolios" SET "subtitle" = $1, "body" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4